import mockImages from "./mockImages";

export const MOCK_NEWS = [
  {
    id: 1,
    title:
      "Honda представила обновления для рынков СНГ и России на 2021 год",
    image: mockImages.hondaNews1,
    description:
      'В 2021 году Honda Motor Rus привезет в Россию 9 новых и обновленных мотоциклов. Это модели CB650R, CBR650R и CB1000R, спецверсии CB1000R Black Edition, NC750X, Gold Wing Tour и CRF300 RALLY, а также новые CMX1100 REBEL и PCX125. Главной новинкой станет мотоцикл Honda CMX1100 REBEL, созданный для неспешных поездок и оснащенный 87-сильным 2-цилиндровым двигателем объемом 1084 куб. см. Этот мотор устанавливался на мотоцикл CRF1100L Africa Twin, но был перенастроен для лучшей динамики на небольших и средних скоростях. Байк получит систему управления Throttle By Wire с четырьмя режимами движения, из которых три — предустановленные, а один — пользовательский. Обновленный Honda CB650R получил ряд доработок. Например, вилку Showa Separate Function Big Piston диаметром 41 мм, способную лучше поглощать удары от неровностей. Повысился и экологический класс 95-сильного двигателя, до Евро-5. У  мотоцикла новый жидкокристаллический дисплей и разъем USB Type-C. Спортбайк Honda CBR650R получил те же обновления, что и нэйкед CB650R. Супербайк Honda CB1000R приобрел новый дизайн и будет также выпускаться в спецверсии Black Edition. Стоит отметить, что мотоцикл оснащен системой голосового управления.',
    author: "Александр Хлынов",
    category: "models",
    releaseDate: "21/03/2021",
  },

  {
    id: 2,
    title:
      "Коронавирус вышвырнул фестиваль скорости Isle of Man TT из 2021 года",
    image: mockImages.tt2,
    description:
      "Десятки тысяч посетителей британского острова Мэн и сотни тысяч фанатов главного шоссейного мотогоночного фестиваля планеты снова остаются без главного угощения из-за вируса COVID-19: в понедельник 30 ноября правительство острова объявило об отмене Isle of Man TT 2021 года, и назвало даты следующего события — с 28 мая по 11 июня 2022 года. Ранее в марте власти острова так же поступили со 101 изданием старейшего мотогоночного события в мире. Отмена состоялась за 2,5 месяца до события, когда мировая пандемия только-только разгонялась. На 1 декабря статистика COVID-19 ухудшилась на порядки порядков: из более чем 62 миллионов случаев заражения 1,4 миллиона были летальными. Всё это беспокоит правительство Мэна, где живет чуть более 80 000 человек. Настолько раннее объявление о судьбе Isle of Man TT (за полгода до 28 мая — 11 июня) вызвало и недоумение, и разочарование команд и гонщиков, включая звезд первой величины Джона МакГиннеса, Питера Хикмана, Майкла Руттера. Для них шоссейные мотогонки вообще и «Турист Трофи» в частности — основной источник дохода и единственная работа. По словам министра предпринимательства острова Мэн Лоуренса Скелли, раннее решение обусловлено стремлением «предоставить чёткость и ясность гоночным фанатам и всем, кто вовлечен в наше событие». На фоне продолжаемой пандемии власти отстрова не могут взять на себя ответность за здоровье тысячи добровольцев и членов других компаний-участников, несмотря на создание и продвижение вакцин от COVID-19, которых весной на момент зачёркивания Isle of Man TT 2020 еще не было. Остров не решился и на утверждение более поздней даты в конце августа, «так как это вызвало бы новые неудобство для тысяч людей». В частности, получив объяснения от гостиничной сферы острова, Скелли понял, что с массовым сдвигом бронирования на конец лета она не справится. Кроме того, ныне остров Мэн живет в карантинном режиме, и одно из его чувствительных ограничений — запрет въезда для любого, кто не является жителем острова. Так как существенная часть Isle of Man TT — это зрители, гонщики, команды и маршалы из «материковой» Великобритании (в 2019 году из более чем 46 000 зрителей 58% были оттуда), у властей острова нет уверенности, что и эти люди, и все остальные «чужеземцы» в мае-июне 2021-го смогли бы прибыть на место гонок. Остатки британского шоссейного мотосезона 2021 пока висят в воздухе. Как объяснил Скелли, отмена «Турист Трофи» не означает такой же судьбы для гонок ретро-мотоциклов Classic TT и Manx Grand Prix в конце августа-начале сентября. Давать им зеленый свет или красный, власти острова решат в следующем марте. В истории знаменитый соревнований 2021 год станет 3 полной отменой после 2001-го (вспышка эпидемии ящура) и 2020-го (коронавирус), если не считать паузу 1940 — 1948 годов из-за Второй мировой войны.",
    author: "По материалам официального пресс-релиза ",
    category: "race",
    releaseDate: "18/01/2021",
  },

  {
    id: 3,
    title:
      "Suzuki-2021 — что нового? Спойлер: ничего.",
    image: mockImages.suzukiNews3,
    description:
      'Модельный ряд мотоциклов из Хамамацу в следующем году остаётся без изменений. Suzuki так и не анонсировала ни одного нового мотоцикла на следующий год. Работы над новым двигателем — и, как следствие, новыми моделями мотоциклов — идут, но в сезоне-2021 мы их, похоже, не увидим. Пока же компания из Хамамацу ограничивается небольшими изменениями, в основном касающимися внешнего вида. Suzuki SV650 к следующему году получит интересную расцветку: жемчужно-белый бак будет контрастировать с красной трубчатой рамой. Возможно, это сделано специально, чтобы вызвать зависть у фанатов Ducati Monster, который лишился своей "птичьей клетки". Если рублёвая цена на SV650 не сильно вырастет в следующем сезоне, то у этого мотоцикла есть все шансы вернуть былую популярность. Главное, чтобы привезли в достаточном количестве. Разумеется, продолжается производство V-Strom 650 — основной ударной силы Suzuki на европейском рынке. Изменения коснуться также только окраски, об этом мы уже писали совсем недавно. Адепты "шестисоток" могут радоваться: в следующем году Suzuki сохранит в производственной программе GSX-R600, который получит простой, но симпатичный бело-красный окрас. Разумеется, останется и GSX-R1000: бороться за кошельки покупателей "литру" поможет полностью чёрная матовая расцветка, а также двусторонний квикшифтер. Для любителей микроспортбайков у "Сузуки" есть GSX250R ABS с двухцилиндровым "рядником". В следующем сезоне он будет выпускаться в бело-чёрной расцветке с красными элементами. Но вот судьба его на Российском рынке неизвестна.',
    author: "ProJapan",
    category: "models",
    releaseDate: "22/03/2021",
  },

  {
    id: 4,
    title:
      "Новый сезон MotoGP стартует уже в ближайшие выходные",
    image: mockImages.gp4,
    description:
      "Гран-При Катара откроет сезон-2021, который должен стать весьма интересным. Надеемся, отмен и виртуальных гонок в стиле 2020 года больше не будет. Один из главных вопросов нового сезона MotoGP — смогут ли прошлогодние победители, Жоан Мир и Suzuki, подтвердить свой чемпионский статус. Но это далеко не единственный вопрос, их намного больше. Вернётся ли в паддок Марк Маркес к третьему этапу, как было заявлено, или же медики порекомендуют ему отдохнуть ещё немного? Сможет ли он, пропустив минимум два этапа, претендовать на чемпионский титул? Как покажут себя новые Ducati? Поможет ли новый мотоцикл Aprilia RS-GP21 подняться команде на более высокие позиции? Объявит ли Валентино Росси о прекращении гоночной карьере в конце этого сезона? Предсказать невозможно, и это прекрасно! Остаётся дождаться первой гонки — и... смотреть все последующие, не отрываясь.",
    author: "bikepost.ru",
    category: "race",
    releaseDate: "26/03/2021",
  },

  {
    id: 5,
    title:
      "ТУРЭНДУРО ОТ HARLEY",
    image: mockImages.hd5,
    description:
      `Идея турэндуро от Harley витала в воздухе давно, но официально оформилась в 2018 году, когда компания Harley Davidson опубликовала свою стратегию "Больше дорог для Harley Davidson". В попытке сделать бренд привлекательным для более широкой молодой аудитории, компания сообщила, что планирует выйти из своей ниши и войти в новые сегменты. План, в частности, включал разработку новых мало (250-500куб.см) и среднекубатурных (500-1250куб.см) платформ, выпуск новых классов мотоциклов и появление долгожданного электрического LiveWire. Тогда-то мы и узнали впервые о Pan America, грядущей звезде первой величины в пантеоне турэндуро. На тот момент компания планировала представить новую модель в 2020 году, но дела пошли не так, как ожидалось. Бывший гендир Левэтич покинул пост в феврале 2020, а его амбициозная стратегия была категорически отвергнута новой управленческой командой в пользу значительно более консервативной стратегии Hardwire. Под руководством нового президента и главного исполнительного директора Йохена Цайца, Harley Davidson существенно снизили число ожидаемых новых моделей, и только две из уже объявленных было решено сохранить: безымянный 1250-кубовый пауэр-круизёр и, собственно, Pan America. Чуть более года после формального представления на EICMA 2019, новый Harley Davidson Pan America 2021 года наконец-то вышел! И судя по нему, Harley хорошо подготовились к покорению новых вершин и сделали мотоцикл, о котором многие давно мечтали. На первом показе прототипа Pan America в 2019 году Harley Davidson подтвердили, что основан этот мотоцикл будет на представителе нового семейства двигателей под названием Revolution Max. На тот момент 60-градусный V-твин жидкостного охлаждения планировался в двух вариантах кубатуры, 975 и 1252 кубических сантиметра. На данный момент о существовании младшего варианта ничего не известно, так как его появление ожидалось на модели Bronx, судя по всему, удалённой из ближайших планов Harley, ну а старшая версия в итоге действительно установлена в Pan Am.`,
    author: "mototeamrussia.com",
    category: "models",
    releaseDate: "04/12/2020",
  },

  {
    id: 6,
    title:
      "Гонка на бэггерах",
    image: mockImages.baggers6,
    description:
      "Крайне необычное соревнование, которые было анонсировано в начале этого года — кольцевая гонка на бэггерах King of the Baggers — прошла вчера на знаменитой трассе Лагуна Сека в Калифорнии. Тринадцать команд вывели по одному подготовленному мотоциклу на старт, чтобы доказать, что именно их программа похудения для тяжеленных туристических монстров самая эффективная. Первое и третье место заняли мотоциклы Indian Challenger, второе — у Harley-Davidson Street Glide. King of the Baggers организована компанией MotoAmerica, которая занимается обычными кольцевыми гонками на привычных нам спортбайках. Идея довольно простая — взять серийный бэггер, немного его доработать (не обязательно ограничиваться напильником), и проехать восемь кругов по трассе. Мероприятие скорее развлекательное, чем серьезное спортивное, вот только команды-участники так не посчитали. Каждый байк на стартовой решетке был абсолютно уникальным, так как регламент гонки был прописан не очень жестко, развязывая руки инженерам.",
    author: "bikepost.ru",
    category: "race",
    releaseDate: "04/04/2021",
  },

  {
    id: 7,
    title:
      "Мотоциклы BMW 2021: что нового?",
    image: mockImages.bmw7,
    description:
      'Инженеры BMW Motorrad не теряли времени даром во время карантина: изменения линейки баварских мотоциклов следующего модельного года не ограничились новыми цветовыми схемами (хотя не обошлось и без этого). Спорт-турер R 1250 RS теперь будет доступен в новом цвете: желтом металлике Austin Yellow с чёрной матовой рамой. Окраска Option 719 Stardust с преобладающим платиновым оттенком пропадёт из списка цветов для этой модели в следующем году. Также из-за нового европейского законодательства водитель не сможет теперь полностью отключить на мотоцикле антиблокировочную систему. В 21-м году R 1250 RS получит новый «спортивный» глушитель взамен прежнего компонента High Performance — судя по всему, это связано с тем, что отныне мотоцикл будет соответствовать экологическому нормативу Евро-5. В качестве дополнительной опций для мотоцикла будет доступна система контроля торможения двигателем, а также анодированные чёрно-серебристые передняя крышка двигателя, крышки головок цилиндров, рычаги сцепления и переднего тормоза, водительские подножки и педали, а также крышки бачков тормозной жидкости (пакеты Shadow и Shadow II). Семейство BMW K 1600 (GT, GTL, B и Grand America) будет комплектоваться в стоке системой помощи при движении на задней передаче, дневными ходовыми огнями, адаптивными фарами для подсветки поворотов и системой дистанционного контроля давления в шинах. Установка долгожданного активного круиз-контроля на мотоциклы этого семейства пока не была подтверждена, возможно, это произойдёт ближе к концу года. Не обошлось без новых цветов: K 1600 GT со следующего года будет доступен в белом металлике Option 719 Mineral White, K 1600 GTL — в бронзовом металлике Manhattan и белом металлике Option 719 Mineral White, BMW K 1600 B and Grand America — в красном металлике Mars Red. Для гипербайка BMW S 1000 RR (на постере) станут доступны дополнительные компоненты «М»: титановый выхлоп, складные рычаги сцепления и переднего тормоза и защита для них, защита двигателя, подножки водителя, усиленная приводная цепь, USB-розетка и GPS-таймер трека. Мотоцикл можно будет купить в красном (Racing Red) и чёрном (Black storm metallic) цветах. Список опций для BMW S 1000 XR 21-го модельного года будет включать титановый глушитель, складные рычаги переднего тормоза и сцепления, защиту двигателя с левой стороны, тюнинговые водительские и пассажирские подножки, усиленную цепь, USB-разъём и багажник, подходящий для установки 30- или 49-литрового верхнего кофра. Все дополнительные опции станут доступны для заказа уже этой осенью.',
    author: "БМВ моторрад",
    category: "models",
    releaseDate: "09/01/2021",
  },

];
